---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSettings.GetPressLossCalculationServerInfo
source: html/301d0233-9033-7ed8-9a66-aaa55c63ddfd.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.GetPressLossCalculationServerInfo Method

Get the MEPServerInfo of the current pipe pressure loss calculation server.

## Syntax (C#)
```csharp
public MEPCalculationServerInfo GetPressLossCalculationServerInfo()
```

## Returns
The MEPServerInfo of the current pipe pressure loss calculation server